Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ཟླ་བ་དྲུག་དང་། ཉིན་ཞག་དྲུག་འདས་ནས་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་སོ། །དེ་ནས་ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་པ་ཏིང་ངེ་འཛིན་འདི་དེ་ལྟར་ཟབ་ལ། དེ་ལྟར་རྒྱ་ཆེ་ཞིང་དེ་ལྟར་ཚད་མ་མཆིས་པའི་ཡུལ་དང་ལྡན་པ་དང་། དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་ལྡན་པ་དང་། དེ་ལྟར་སྣང་བ་མཚུངས་པ་མ་མཆིས་པ་དང་། དེ་ལྟར་གྲངས་མ་མཆིས་པའི་རྒྱན་དང་ལྡན་པ་དང་། དེ་ལྟར་མི་འཕྲོགས་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་དང་། དེ་ལྟར་མ་འདྲེས་པའི་ཡུལ་དང་ལྡན་པ་དང་། དེ་ལྟར་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བ་དང་། ཏིང་ངེ་འཛིན་འདི་དེ་ལྟར་སེམས་ཅན་གྱི་དོན་ཚད་མ་མཆིས་པ་རབ་ཏུ་སྒྲུབ་པར་གྱུར་པ་ནི་ངོ་མཚར་ཏེ། དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཚད་མ་མཆིས་པ་རྣམ་པར་ཞི་བར་བགྱི་བ་ལ་སྟ་གོན་དུ་གནས་པ་སྟེ། འདི་ལྟར་དབུལ་བའི་སྡུག་བསྔལ་ཞི་བར་བགྱི་བ་ལ་སྟ་གོན་དུ་གནས་སོ། །སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་རྒྱུན་བཅད་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ལས་ཡོངས་སུ་བསྐྱབ་པ་དང་། མི་ཁོམ་པའི་ལམ་གྱི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་གཅད་པ་དང་། མཐོ་རིས་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་ཕྱིན་པར་བགྱི་བ་དང་། ལྷ་དང་མིའི་དགའ་བ་དང་། བདེ་བ་འབྱུང་བར་བགྱི་བ་དང་། བསམ་གཏན་གྱི་ཡུལ་གྱིས་དགའ་བ་ཉམས་སུ་མྱོང་བར་བགྱི་བ་དང་། འདུས་བྱས་ལ་སྤྱོད་པའི་བདེ་བ་ཡོངས་སུ་འཕེལ་བར་བགྱི་བ་དང་། ཁམས་གསུམ་པ་ལས་འབྱུང་བའི་སྒོ་ཡོངས་སུ་བསྟན་པ་ལ་སྟ་གོན་དུ་གནས་སོ། བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་སྐྱེ་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་ལ་སྟ་གོན་དུ་གནས་སོ། །
en: When six months and six days had passed, the bhikṣu Sāgara­dhvaja arose from his samādhi.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡང་དག་པར་སྐྱེ་བའི་རྒྱུ་རྣམ་པར་འཕེལ་བར་བགྱི་བ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཤུགས་རྒྱ་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བགྱི་བ་དང་། སྨོན་ལམ་ཆེན་པོའི་སྟོབས་ཡོངས་སུ་བསྐྱེད་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བགྱི་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་པོའི་ཐེག་པ་རྣམ་པར་དགོད་པ་དང་། ཐེག་པ་ཆེན་པོའི་ཁྱད་པར་ལ་འཇུག་པ་མངོན་པར་བསྒྲུབ་པ་དང་། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཤེས་ཤིང་སྣང་བར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཤེས་ཤིང་སྣང་བ་ཐོབ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་སྤྱོད་པ་དང་། འབྱུང་བའི་རྒྱན་རྣམ་པར་དག་པ་ཡོངས་སུ་བསྒྲུབ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ས་གནན་པ་ལ་ཐོགས་པ་མ་མཆིས་པར་བགྱི་བ་ལ་སྟ་གོན་དུ་གནས་པའོ། །
en: Then Sudhana said to him, “Ārya, this wonderful samādhi that is so profound; that is so vast; that has such an immeasurable scope; that has such an inconceivable manifestation; that has such an unequaled radiance; that has such innumerable displays; that has such an inviolable range; that has such an unalloyed scope; that has such a universal illumination; that has such an accomplishment of benefit for limitless beings; that brings such a cessation of the measureless sufferings of all beings; that is present in order to end the sufferings of poverty; that is present in order to save beings from existences of rebirth as animals, in order to close all the gateways that lead to unfortunate existences, in order to lead onto the path to higher existences, in order to bring the joy and happiness of devas and humans, in order to bring the experience of joy within the scope of meditation, in order to increase joy in composite conduct, and in order to show the gateway to escape from the three realms that is present in order to illuminate the causes for the creation of the aspiration to enlightenment, to increase the causes for generating the accumulations of merit and wisdom, to increase the vast power of great compassion, to develop the strength of great prayers, to attain the illumination of the path of the bodhisattvas, to establish the yāna of the perfections, to accomplish entry into the exceptional Mahāyāna, to know and illuminate the completely good conduct, to know and attain the illumination of the bodhisattva bhūmi, to accomplish the prayers, conduct, and pure-emergence displays of all the bodhisattvas; and that becomes present in order to ascend without impediment to the level of omniscience—Ārya, what is the name of this samādhi?”

source: འཕགས་པ་ཏིང་ངེ་འཛིན་དེའི་མིང་ཅི་ཞེས་བགྱི་སྨྲས་པ། རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ནས་ལྟ་བའི་བཏང་སྙོམས་ཡོངས་སུ་ཐོབ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: The bhikṣu Sāgara­dhvaja answered, “Noble one, it is the perfection of wisdom called the complete vision of the attainment of equanimity.

source: ཏིང་ངེ་འཛིན་འདི་ནི་དེའི་སྣང་བ་སྟེ། སྒོ་ཀུན་ནས་རྣམ་པར་དག་པའི་རྒྱན་ཅེས་བྱའོ། །
en: The radiance of that samādhi is called the pure display of every gateway.

source: རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ནས་ལྟ་བའི་བཏང་སྙོམས་རབ་ཏུ་ཐོབ་པའི་སྣང་བ་ལས་སྐྱེས་པའི་ཏིང་ངེ་འཛིན་སྒོ་ཀུན་ནས་རྣམ་པར་དག་པའི་རྒྱན་ཅེས་བྱ་བ་འདི་ཤིན་ཏུ་བསྒོམས་ན་སྒོ་ཀུན་ནས་རྣམ་པར་དག་པའི་རྒྱན་ལ་སྩོགས་པ་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་ཚང་བ་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་རོ། །སྨྲས་པ།
en: “Noble one, if you meditate on the pure display of every gateway samādhi that arises from attaining the radiance of the perfection of wisdom called the complete vision of the attainment of equanimity, then you will accomplish ten times countless hundreds of thousands of samādhis such as the pure display of every gateway.”

source: འཕགས་པ་ཏིང་ངེ་འཛིན་འདིའི་ཡུལ་དེར་བས་སམ་མ་བས། སྨྲས་པ། རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་འདི་ལ་སྙོམས་པར་ཞུགས་པ་ལ་ནི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དམིགས་པ་ལ་ཐོགས་པ་མེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་སུ་འཇུག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་གནོན་པ་ལ་ཐོགས་པ་མེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་བརྒྱན་པ་ལ་ཐོགས་པ་མེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་སྦྱང་བ་ལ་ཐོགས་པ་མེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་བལྟ་ཞིང་རྣམ་པར་དམིགས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བ་བརྟག་པ་ལ་ཐོགས་པ་མེད་དོ། །
en: Sudhana asked, “Ārya, what is the range of this samādhi?”

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་སྟོབས་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོར་འཇུག་པ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་གཟུང་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་མ་འདྲེས་པ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །
en: The bhikṣu Sāgara­dhvaja answered, “Noble one, if you rest in this samādhi, you will have no impediment in perceiving world realms; you will have no impediment in entering those world realms; you will have no impediment in overpowering those world realms; you will have no impediment in adorning those world realms; you will have no impediment in cleansing those world realms; you will have no impediment in purifying those world realms; you will have no impediment in perceiving and looking at the buddhas; you will have no impediment in examining the greatness of the buddhas; you will have no impediment in knowing the miracles of the buddhas; you will have no impediment in comprehending and understanding the strengths of the buddhas; you will have no impediment in comprehending the ocean of the qualities of the buddhas; you will have no impediment in obtaining the rain of the Dharma clouds of the buddhas; you will have no impediment in knowing and understanding distinctly the Dharma wheels of the buddhas; you will have no impediment in comprehending and understanding the ocean of the circles of followers of the buddhas; you will have no impediment in comprehending and following the ten directions; you will have no impediment in examining the Dharma taught by the buddhas; you will have no impediment in examining the directions of the buddhas; you will have no impediment in never abandoning the direction of great compassion; you will have no impediment in filling the directions with great love; you will have no impediment in never tiring of the direction of gazing at the buddhas; you will have no impediment in comprehending and understanding all of the ocean of the buddhas; you will have no impediment in knowing and understanding all of the ocean of beings; you will have no impediment in knowing and understanding all of the ocean of the faculties of beings; and you will have no impediment in knowing all the different faculties of beings.

source: ཕྱོགས་བཅུར་འཇུག་ཅིང་རྗེས་སུ་བགྲང་བར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པ་རྗེས་སུ་བརྟག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་ཀྱི་ཕྱོགས་རྗེས་སུ་བརྟག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སྙིང་རྗེ་ཆེན་པོའི་ཕྱོགས་རྣམ་པར་མི་སྤང་བ་ལ་ཐོགས་པ་མེད་དོ། །བྱམས་པས་ཕྱོགས་རྒྱས་པར་དགང་བ་ལ་ཐོགས་པ་མེད་དོ། །སངས་རྒྱས་བལྟ་བའི་ཕྱོགས་ལ་འཇུག་པས་མི་ངོམས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །
en: “Noble one, I know only this conduct of the perfection of wisdom.

source: སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་དུ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་གྱི་དབང་པོ་རྒྱ་མཚོ་ཐམས་ཅད་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །སེམས་ཅན་གྱི་དབང་པོ་ཐ་དད་པ་ཐམས་ཅད་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་འདི་ཤེས་སུ་ཟད་ན། བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡུལ་ལ་བློ་གྲོས་རྣམ་པར་དག་པ།
en: How could I know or describe the qualities of, teach the conduct of, describe the scope of, praise the strength of the great prayers of, illuminate the gateway for the emergence of, describe the true accomplishment of, teach the path of, follow the continuum of samādhi of, know the scope of the mind of, or be able to comprehend the equanimity of the wisdom of the entry by the bodhisattvas in the ocean of the conduct of the perfection of wisdom?

source: ཆོས་ཐམས་ཅད་ལ་རིག་པ་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་ཅན། བློ་ཤིན་ཏུ་ཡངས་པས་ཚད་མེད་པའི་ཡུལ་རྒྱས་པར་འགེངས་པ་གཟུངས་ཆེན་པོའི་སྣང་བ་ལ་དབང་བསྒྱུར་བ། ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་སྣང་བ་ཐམས་ཅད་ཤིན་ཏུ་དག་པ་མངོན་པར་ཤེས་པ་རྣམ་པར་འགྲུལ་བ་དང་། ཁྱུ་མཆོག་གི་མཐུ་འབྱིན་པ་ལ་ཤིན་ཏུ་བྱུང་བ་སོ་སོ་ཡང་དག་པར་རིག་པ་མི་ཟད་པའི་རྒྱ་མཚོ་ལ་ཞུགས་པ། ངག་སྙན་པ་སའི་སྙིང་པོ་དང་ལྡན་པ་བརྗོད་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྟེན་དུ་གྱུར་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ།
en: So too of the pure understanding of the scope of the realm of phenomena, of having the wisdom that follows knowing all phenomena, of pervading the immeasurable field of perception with a vast understanding, of having the power of the radiance of great mental retention, of the purity of the radiance of the field of samādhi, of the emergence of the mighty power of miraculous clairvoyance, of entering an ocean of unceasing discernment, of the sweet voice of the essence of the bodhisattva bhūmi, or of becoming a refuge for all beings.

source: ཡོན་ཏན་བརྗོད་པའམ། སྤྱོད་ཡུལ་བསྟན་པའམ། ཡུལ་རབ་ཏུ་བརྗོད་པའམ། སྨོན་ལམ་ཆེན་པོའི་སྟོབས་ཡང་དག་པར་བསྔགས་པའམ། འབྱུང་བའི་སྒོ་ཡོངས་སུ་སྣང་བར་བྱ་བ་འམ། ཡང་དག་པར་བསྒྲུབ་པ་མངོན་པར་བརྗོད་པའམ། ལམ་ཡོངས་སུ་བསྟན་པའམ། ཏིང་ངེ་འཛིན་གྱི་རྒྱུན་གྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའམ།
en: “Depart, noble one.

source: སེམས་ཀྱི་ཡུལ་ཤེས་པར་བྱ་བའམ། ཡེ་ཤེས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་བར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཕྱོགས་ཀྱི་གནས་རྒྱ་མཚོ་རྣམ་པར་རློབ་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཞིག་གྲོང་ཁྱེར་འོད་ཆེན་པོ་ཞེས་བྱ་བའི་ཤར་ཕྱོགས་ལོགས་ན་ཡོད་དེ།
en: In this southern region there is a land called Samudravetāḍī, in which there is a park named Samanta­vyūha to the east of the city Mahāprabhasa.

source: དེ་ན་ཤེད་ལས་སྐྱེས་པའི་རྒྱལ་པོ་འོད་བཟངས་ཀྱི་ཆུང་མ་དགེ་བསྙེན་མ་ཡིད་བཞིན་ཞེས་བྱ་བ་ཡོད་ཀྱིས།
en: There dwells an upāsikā by the name of Āśā, who is the wife of Suprabhasa, a lord over humans.

source: ཇི་ལྟར་ནན་ཏུ་བྱ་བ་དྲིས་ཤིག །
en: How should a bodhisattva practice it?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ལས་སྙིང་པོ་ཡོངས་སུ་བླངས་ཏེ། ཆོས་ཀྱི་ཉེ་བར་འཚོ་བ་བྱས་པ། ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ལ་ཞུགས་པ། སྣང་བ་ཐོབ་པ་ཡེ་ཤེས་ཀྱིས་སྣང་བར་གྱུར་པ། ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། མོས་པ་རྣམ་པར་དག་པ་ཁོང་དུ་ཆུད་པ། སེམས་ཅན་ཆོས་ཀྱི་ཚུལ་གྱིས་སྣང་བའི་རྗེས་སུ་སོང་བ། རྣམ་པར་དག་པའི་སྒོས་སྣང་བ་དང་ལྡན་པར་གྱུར་པ། ཕྱོགས་སུ་ཡེ་ཤེས་ཀྱི་སྣང་བ་རབ་ཏུ་འདལ་བ་དེས།
en: Then Sudhana, the head merchant’s son, was overjoyed, pleased, happy, and content, having received the essence from the bhikṣu Sāgara­dhvaja, having been nourished by the Dharma, having been brought into the field of samādhi, having attained the illumination of the light of wisdom, having attained the illumination of the radiance of samādhi, having realized a pure aspiration, his mind having followed the radiance of the way of the Dharma, possessing the radiance from the pure gateways, and having the wisdom that has arisen from the light of all directions.

source: དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ལ་བཏུད་དེ་ཕྱག་འཚལ་ནས། ཡང་དང་ཡང་ལྟ་ཞིང་ཡང་དང་ཡང་མངོན་པར་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། རབ་ཏུ་གདུད་པ་དང་། གུས་པར་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། ཡིད་ལ་བྱ་བ་དང་། བསམ་པ་དང་། བསྒོམ་པ་དང་། ཡོངས་སུ་བསྒོམ་པ་དང་། ལེགས་པར་བརྗོད་པ་དང་། ངོ་མཚར་དུ་བྱ་བ་དང་། ཡོན་ཏན་མངོན་དུ་བྱ་བ་དང་། རྗེས་སུ་བསྔགས་པ་དང་། རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བརྟན་པར་བྱ་བ་དང་། མི་གཏང་བ་དང་། ཡིད་ལ་བསམ་པ་དང་། རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། སྨོན་ལམ་གྱི་རྗེས་སུ་འཇུག་པར་བྱ་བ་དང་། མཐོང་བར་དགའ་བ་དང་། དབྱངས་ཀྱི་མཚན་མ་གཟུང་བ་དང་། གཟུངས་ཀྱི་རྗེས་སུ་བསམ་པ་དང་། མིང་ཡོངས་སུ་གཟུང་བའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པར་བྱ་བ་དང་། ཁ་དོག་དང་། དབྱིབས་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། ཡེ་ཤེས་ཀྱི་ཡུལ་རྗེས་སུ་བསམ་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ལ་རྗེས་སུ་འཇུག་པར་བྱ་བ་དང་། སྨོན་ལམ་གྱི་ཡུལ་ལ་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། སྤྱོད་ཡུལ་གྱི་ཡུལ་རྣམ་པར་སྦྱང་བར་བྱ་བ་དང་། ཡེ་ཤེས་ཀྱི་སྣང་བ་ཡོངས་སུ་གཟུང་བ་བྱེད་ཅིང་། དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་སོ་གཅིག་པ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་ཡོན་ཏན་གྱིས་ནི་མགུ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ནི་ཡང་དག་པར་བསྔགས་ཏེ་བཏང་། དགེ་བའི་བཤེས་གཉེན་མཐོང་བའི་བྱིན་གྱིས་ནི་བྱིན་དུ་བརླབས།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Sāgara­dhvaja, circumambulated the bhikṣu Sāgara­dhvaja a hundred thousand times, keeping him to his right, bowed down and paid homage to the bhikṣu Sāgara­dhvaja, and, looking back again and again, paying homage to him, bowing down to him, venerating him, respecting him, keeping him in mind, thinking of him, meditating on him, meditating deeply on him, speaking highly of him, calling out in wonderment over him, focusing on his qualities, praising him, being his follower, remembering him, relying on him, never forsaking him, mentally approaching him and being connected with him, being unified in prayer, longing to see him, remembering the qualities of his voice, preserving the memory of him, keeping his name in his mind, remembering his color and his form, contemplating the scope of his wisdom, comprehending the range of his samādhi, joining him in the scope of his prayers, practicing the range of his conduct, and receiving the radiance of his wisdom, he departed from the presence of the bhikṣu Sāgara­dhvaja.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནི་ནན་ཏན་དུ་བྱེད། དགེ་བའི་བཤེས་གཉེན་ཡིད་དུ་འོང་བ་ནི་རྗེས་སུ་སེམས། དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འབྱུང་གནས་ཙམ་དུ་ལྟ། དགེ་བའི་བཤེས་གཉེན་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སྟོན་པ་ཡིན་པར་ཡང་དག་པར་ལྟ། དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ལ་རྗེས་སུ་ལྟ།
en: Āśā Chapter 10 Sudhana, the head merchant’s son, delighted by the qualities of the kalyāṇamitra, sent forth by the kalyāṇamitra, empowered by the sight of the kalyāṇamitra, practicing the instructions of the kalyāṇamitra, remembering the words of the kalyāṇamitra, and contemplating the kalyāṇamitra with affection, saw kalyāṇamitras as the source of the Buddhadharma, saw kalyāṇamitras as the teachers of the Buddhadharma, saw kalyāṇamitras as masters in the Dharma of omniscience, and saw the kalyāṇamitras as eyes that look into the sky of buddhahood.

source: དགེ་བའི་བཤེས་གཉེན་ནི་སངས་རྒྱས་ནམ་མཁའ་བལྟ་བ་ལ་མིག་ཙམ་ཏུ་ལྟ་ཞིང་མཐར་གྱིས་ཕྱོགས་ཀྱི་གནས་རྒྱ་མཚོ་རྣམ་པར་རློབ་པའི་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ།
en: Eventually he came to the Samanta­vyūha Park in Samudravetāḍī.

source: གང་ན་བ་དེར་ཕྱིན་ནས་དེས་མཐོང་བ། བཟའ་ཤིང་གི་རབ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ར་བས་ཀུན་ནས་བསྐོར་བ། རིན་པོ་ཆེའི་ཤིང་གི་ཕྲེང་བ་སྤེལ་བ་ལེགས་པས་ཡོངས་སུ་བརྒྱན་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གི་ཕྲེང་བའི་མེ་ཏོག་སྲབ་བུ་ཡིད་དུ་འོང་བའི་སྤྲིན་རབ་ཏུ་འབྲུལ་བས་གཞི་རྒྱས་པ།
en: He saw the Samanta­vyūha Park, which was encircled by precious walls and rows of precious trees that were perfectly adorned and by rows of beautiful, delicate flowers, made of all precious materials, that released clouds of pollen that were spread across the ground.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གིས་ཡང་དག་པར་བརྒྱན་པ།
en: It was adorned by trees made of all precious materials.

source: ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ།
en: It was filled with a variety of blossoming flowers of precious trees. The beautiful aroma from rows of various incense trees spread in every direction.

source: སྤོས་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ཕྲེང་བ་ལས་ཕྱོགས་ཀུན་ཏུ་སྤོས་ཀྱི་ངད་ཞིམ་པ་རིན་པོ་ཆེའི་ཕྲེང་བའི་ཤིང་སྣ་ཚོགས་ཀྱི་ལྷུན་ལས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་འཕྱང་བ། རབ་ཏུ་འབྱུང་ཞིང་ཆར་ལྟར་མངོན་པར་བབ་པ།
en: Strings of all kinds of jewels were hanging from the various trees like a rainfall of strings of jewels showering down.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ཤིང་དང་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་མཛེས་ཤིང་སྤ་ལ།
en: The trees made of all the kings of jewels were bestrewed, bedecked, and beautified by a variety of precious jewels.

source: རྒྱ་ཆེར་བརྒྱན་པའི་གཞི་ཅན་ཡིད་བཞིན་གྱི་གོས་ཀྱི་ཤིང་ཐམས་ཅད་ལས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་གོས་འབྱུང་བས་གམ་ཡོ་ཁེབས་ཤིང་མཛེས་པར་བརྒྱན་པ།
en: All the wish-fulfilling flower trees were beautified and covered by being draped with clothing of various colors.

source: སིལ་སྙན་གྱི་ཤིང་ཐམས་ཅད་ལས་ལྷ་རྫས་ལས་ཀྱང་འཕགས་པའི་སིལ་སྙན་རླུང་གིས་བསྐྱོད་ཅིང་སྒྲ་འབྱིན་པའི་དབྱངས་སྙན་པར་འབྱུང་བ།
en: When all the musical trees were moved by the breeze there came the beautiful sound of music from instruments superior to those of the devas.

source: སའི་གཞི་མཐོན་དམན་མེད་པར་གནས་པ་རྒྱན་གྱི་ཤིང་སྣ་ཚོགས་ཀྱི་གསེབ་ནས། རྒྱན་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་རྒྱུན་ཏུ་འབྱུང་ཞིང་འཕྱང་བས། རབ་ཏུ་བརྒྱན་པའི་རྒྱན་དང་ལྡན་པ་མཐོང་སྟེ།
en: The ground was perfectly level, and upon it was the display of all the various kinds of adorned trees that were hung and beautified with various kinds of ornaments.

source: བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་དེའི་ནང་ན་ཁང་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཀུན་ཀྱང་ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་སྣ་ཚོགས་ཀྱི་བ་གམ་གྱིས་རྣམ་པར་བརྒྱན་པ་དང་། ཁང་པ་བརྩེགས་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་བརྩེགས་པའི་བད་དང་ལྡན་པ་དང་། གཞལ་མེད་ཁང་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཀ་གདུང་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བ། ལས་བྲེས་པ། རྫིང་བུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་གཞི་བླངས་ཏེ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕ་གུས་མུ་ཁྱུད་བྱས་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཐེམ་སྐས་བཏགས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྟེགས་བུས་བསྐོར་བ། ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་དྲི་དང་ལྡན་པའི་ཆུས་གང་བ། གསེར་གྱི་བྱེ་མས་ཀུན་ཏུ་གྲམ་པ། གཞི་ནོར་བུ་རིན་པོ་ཆེ་ཆུ་འདང་ཀུན་ཏུ་བཀྲམ་པ། ཕྱོགས་བཞི་ནས་ཐེམ་སྐས་རྣམ་པར་བྲེས་པ། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་གང་བ། ང་དུར་དང་། རྨ་བྱ་དང་། ཁུ་བྱུག་དང་། ཁྲུང་ཁྲུང་དང་། ཀ་ལ་པིང་ཀ་དང་། ཀུ་ན་ལའི་སྒྲ་སྐད་སྙན་པའི་དབྱངས་དང་ལྡན་པ། རིན་པོ་ཆེའི་ཏ་ལའི་ཕྲེང་བས་ཀུན་ནས་བརྒྱན་པ། གསེར་གྱི་དྲིལ་བུའི་དྲ་བས་ཀུན་ནས་ཡོག་པ། རླུང་གིས་བསྐྱོད་པའི་སྒྲ་ཡིད་དུ་འོང་བ་འབྱུང་བ།
en: Within the great park of Samanta­vyūha there were ten trillion mansions that had an array of spires made of the best precious jewels; there were a hundred thousand kūṭāgāras with their towers covered with Jambu River gold; there were a hundred thousand aerial palaces with interiors beautified by shining precious jewels; there were a million ponds made of all precious materials, with walls made of bricks of various precious materials and with steps made of all precious materials, encircled by a balcony of various precious materials, filled with water that had the aroma of divine sandalwood, strewn with gold dust, their bottoms spread with precious water-purifying jewels, adorned on all four sides with stairways, filled with water that had the eight qualities, with geese, peacocks, cuckoos, cranes, and avadavats all emitting divine melodious songs, encircled by rows of precious palm trees hung with networks of little golden bells that emitted beautiful sounds when they were shaken by breezes, covered with a precious canopy, encircled by a wall of trees made of various precious materials, and with standing parasols and banners draped in nets of jewels.

source: སྟེང་ནས་རིན་པོ་ཆེའི་བླ་རེ་ཆེན་པོ་བྲེས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ར་བས་ཡོངས་སུ་བསྐོར་བ། རིན་པོ་ཆེའི་དྲ་བས་བརྒྱན་པའི་གདུགས་དང་རྒྱལ་མཚན་ལེགས་པར་བསྒྲེང་བ། ལུ་མ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དུས་དང་མཐུན་པའི་ཙན་དན་གྱི་འདམ་གྱིས་མཐའ་འཁོར་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཏུ་འདུག་པའི་པད་མོས་ཡོངས་སུ་ཁྱབ་པ། རིན་པོ་ཆེའི་པད་མོའི་འོད་ཆེན་པོས་སྣང་བར་གྱུར་པའི་ཆུ་དྲི་མ་མེད་པ་དང་ལྡན་པ་ཡོད་པ་སྟེ།
en: All around there were a million ponds with yellow sandalwood mud, covered with lotuses of various colors made from all precious materials and filled with stainless water illuminated by the great radiance of the precious lotuses.

source: བཟའ་ཤིང་གི་ར་བ་དེའི་དབུས་ན་གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱལ་མཚན་སྣ་ཚོགས་ཞེས་བྱ་བ།
en: In the center of Samanta­vyūha Park there was a great aerial palace called Vicitra­dhvaja.

source: སའི་གཞི་རིན་པོ་ཆེ་རྒྱ་མཚོའི་སྙིང་པོ་ལས་བླངས་པ། ནོར་བུ་རིན་པོ་ཆེའི་ཀ་བ་བཀྱེ་བ་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལྷུན་མངོན་པར་འཕགས་པ་ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བར་རྣམ་པར་སྣང་བའི་སྤང་ལེབ་བཀྱེ་བས་བརྒྱན་པ། གཞི་ནོར་བུ་རིན་པོ་ཆེ་འབར་བ་གྲངས་མེད་པའི་དྲ་བས་བྲེས་པ།
en: It had a floor made of jewels from within the ocean; it was adorned by beryl jewel pillars, with a high spire of Jambu River gold and with floorboards that were a display of precious jewels that illuminated the world; and it was draped in countless nets of shining precious jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་མི་ཕམ་པའི་སྤོས་ཀྱི་དྲིས་གམ་ཡོ་ཀུན་ནས་བདུགས་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་སྒྲ་སྙན་པ་འབྱིན་པའི་དྲི་ངད་ཀུན་ཏུ་ལྡང་བ། རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲི་རྣམ་པར་གསལ་བར་བྱེད་པས་དབང་པོ་རྣོ་བའི་བག་ཆགས་རྣམ་པར་བསྒྲུབ་པ་དང་ལྡན་ཞིང་གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱལ་མཚན་སྣ་ཚོགས་དེར་སྟན་གྲངས་མེད་ཅིང་ཚད་མེད་པ་བཏིང་བར་གྱུར་པ་འདི་ལྟ་སྟེ་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་སྣང་བར་བྱེད་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བ་ཡིད་དུ་འོང་བའི་པད་མོའི་སྙིང་པོ་ཅན་དང་།
en: It had the scent of the perfume of the invincible kings of jewels that perfume the environs, the scent of the kings of music-emitting jewels that spread everywhere, and the kings of stain-eliminating jewels that establish the propensities for sharp faculties.

source: ནོར་བུ་རིན་པོ་ཆེ་མཛོད་སྣ་ཚོགས་ཀྱི་པད་མོའི་སྙིང་པོ་ཅན་དང་། རིན་པོ་ཆེ་སེང་གེའི་ཤིང་ཐགས་ཀྱི་པད་མོའི་སྙིང་པོ་ཅན་དང་།
en: In this celestial mansion called Vicitra­dhvaja, countless, innumerable seats, which were lotus pericarps, had been arranged.

source: ནོར་བུ་རིན་པོ་ཆེ་དྲི་མ་མྱེད་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེས་བརྒྱན་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྒོ་ཀུན་ནས་བརྒྱན་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་འོད་ཀྱི་རྒྱན་གྱི་པད་མའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྒྱ་མཚོའི་གནས་རྣམ་པར་དག་པའི་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པའི་འོད་ཟེར་ཀུན་ཏུ་འབྱུང་བའི་པད་མོའི་སྙིང་པོ་ཅན་དང་།
en: There had been arranged and set out lotus pericarps of precious jewels that illuminated the directions, lotus pericarps of shining precious jewels, lotus pericarps of precious jewels that illuminated the world, lotus pericarps that were manifold treasuries of precious jewels, lotus pericarps of lion-cage precious jewels, lotus pericarps of stainless precious jewels, lotus pericarps that were a display of precious jewels, lotus pericarps of precious jewels that faced everywhere, lotus pericarps of precious jewels that were a display of lights, lotus pericarps of pure precious jewels from the ocean, which were precious jewels that shone with light rays, and lotus pericarps of overpowering vajra-lion precious jewels.
